Catalogs/КодыРегионовФССП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>КодыРегионовФССП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодРегионаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КодыРегионовФССП/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура Выгрузить(Команда)
	// Вставить содержимое обработчика.
		
	  Выгр();
	
	
	Сообщить("Ок");
КонецПроцедуры


&НаСервере
Процедура Выгр()

	   Shell = Новый COMОбъект("WScript.Shell");
       дирМоиД=Shell.SpecialFolders.Item("MyDocuments");

	   ИмяФайла= дирМоиД+"\фсспрегион.txt";
	
	    Файл = Новый ЗаписьТекста(ИмяФайла);
	
	     	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыРегионовФССП.КодРегионаФССП КАК КодРегионаФССП,
		|	КодыРегионовФССП.Наименование КАК Наименование,
		|	КодыРегионовФССП.Синоним КАК Синоним
		|ИЗ
		|	Справочник.КодыРегионовФССП КАК КодыРегионовФССП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		
		 //Файл.ЗаписатьСтроку("Привет!");
		  
		 Стр=ВыборкаДетальныеЗаписи.КодРегионаФССП+":"+ВыборкаДетальныеЗаписи.Наименование+"@" +ВыборкаДетальныеЗаписи.Синоним;
	      Файл.ЗаписатьСтроку(Стр);	 

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	  
	 Файл.Закрыть();
	
	

КонецПроцедуры


&НаКлиенте
Процедура Загрузить(Команда)
	// Вставить содержимое обработчика.
	
	    Shell = Новый COMОбъект("WScript.Shell");
       дирМоиД=Shell.SpecialFolders.Item("MyDocuments");

  	   ИмяФайла= дирМоиД+"\фсспрегион.txt";

	
		ПрочитанныйТекст = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
											
    	Строка = ПрочитанныйТекст.ПрочитатьСтроку();
		
		ЗаписатьСтр(Строка);
		
		Пока Строка <> Неопределено Цикл
                  Строка = ПрочитанныйТекст.ПрочитатьСтроку();
				  ЗаписатьСтр(Строка);
				  
     
        КонецЦикла;
		
		ПрочитанныйТекст.Закрыть();
		
	
	   Сообщить("Загружено");
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьСтр(Строка)

	
	
	 стркт=ОбрСтр(Строка);
	 
	  //  Записать в справочник.
	  
	  Если стркт.НаименованиеФССП<>"" Тогда
	  
	  	  ЗаписатьСтрСпр(стркт.НаименованиеФССП,стркт.КодФССП,стркт.СинонимФССП)

	  
	  КонецЕсли;
	  	 

 КонецПроцедуры
 
 
 &НаСервере
 Процедура ЗаписатьСтрСпр(наим,кодфссп,синФссп)
	 
	 
	    СпрСсылка=Справочники.КодыРегионовФССП.НайтиПоНаименованию(наим);
		
		 //Если  СпрСсылка.Ссылка=Неопределено  Тогда
		 
		 	  НовыйЭлемент = Справочники.КодыРегионовФССП.СоздатьЭлемент(); 
		      НовыйЭлемент.Наименование =наим;
			  НовыйЭлемент.КодРегионаФССП=кодфссп;
			  
			  НовыйЭлемент.Синоним=синФссп;
		      НовыйЭлемент.Записать(); 

		 
		 //КонецЕсли;
		
			 			  
 
 КонецПроцедуры
 
 
 
 
 
  
  &НаКлиенте
  Функция ОбрСтр(стрк)
	  
	  стрстр = Новый Структура;
	  
	  длинастр=СтрДлина(стрк);
	  
	  поз=Найти(стрк,":");
	  
	  числКод=длинастр-поз;
	  
	  кодфссп=Лев(стрк,поз-1);
	  
	  
	  позНаим=Найти(стрк,"@");
	  
	  
	  наимФссп=Сред(стрк,поз+1, позНаим-поз-1);
	  
	  
	  синонимФссп=Прав(стрк,длинастр-позНаим);
	  
	  
	  стрстр.Вставить("КодФССП",кодфссп);
	  
	  стрстр.Вставить("НаименованиеФССП",наимФссп);
	  
	  стрстр.Вставить("СинонимФССП",синонимФссп);
	  
	  
	  Возврат стрстр;
	  
	  
  
  КонецФункции // ()
